import java.util.Scanner;

public class M22FromLeftToTheRight {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);

        int countOfNumber = Integer.parseInt(scanner.nextLine()); // четем от конзолата броя на числата, които ще четем след това

        for (int i = 0; i < countOfNumber; i++) {// въртим цикъла до броя на числата
            String input = scanner.nextLine();//взимаме инпута на числото, което ще търсим лява и дясна стойност

            String left = "";//събираме левите цифри до празен чар - като стринг
            String right = "";//събираме десните цифри след празния чар - като стринг
            boolean flag = false;//слагаме си флаг, който ще стане тру когато прочетем празният символ.
            for (int j = 0; j < input.length(); j++) {//въртим цикъл до дължината на инпута
                char digit = input.charAt(j);//вземаме всеки символ от инпута по отделно като чар

                if (flag) {//ако флафа е тру - т.е. сме минали през празният символ ще събираме цифрите от дясно - като стринг
                    right += digit;
                } else {// ако флага е фолсе - т.е. не сме минали през празен чар правим проверка:
                    if (digit != ' ') {//чара празен ли е ? Ако не е събираме цифрата към лявата сума - като стринг
                        left += digit;
                    } else {// ако чара е празен тогава правим флага тру
                        flag = true;
                    }
                }
            }//след като сме прочели числата разделени с празен символ и сме ги отделили в два стринга, следва да ги парснем като числа
            long leftSum = Long.parseLong(left);// парсваме лявото - използваме лонг т.к. по условие ще имаме голямо число над инт
            long rightSum = Long.parseLong(right);//парсваме дясното - тк също ползваме лонг
            long greaterNumber = Math.max(leftSum, rightSum);//намираме по-голямото - лонг

            int sum = 0;//търсим сумата на цифрите в по-голямото число
            while (greaterNumber != 0) {//докато по-голямото число е > 0 ще въртим цикъла
                sum += greaterNumber % 10;//по този начин вземаме последната цифра от числото и я добавяме към сумата
                greaterNumber = greaterNumber / 10;//тук махаме последната цифра от числото пример ако числото е било 1234, сегае 123
            }
            System.out.println(Math.abs(sum));//принтираме сумата на числото - 1-вия фор се завърта отново - до ограничението си
        }
    }
}
